CSI API ETABS v1

# cTowerSetActiveTower Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetActiveTower(
    	string TowerName
    )

    Function SetActiveTower (
    	TowerName As String
    ) As Integer

    Dim instance As cTower
    Dim TowerName As String
    Dim returnValue As Integer

    returnValue = instance.SetActiveTower(TowerName)

    int SetActiveTower(
    	String^ TowerName
    )

    abstract SetActiveTower :
            TowerName : string -> int

#### Parameters

TowerName

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cTower Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com